Revit 2024 API
SelectionFilterElement.Clear Method
 Removes all ElementIds from the filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void Clear()
Visual Basic
Public Sub Clear
Visual C++
public:
void Clear()
See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace